In [1]:
import pandas as pd
import numpy as np

In [116]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Lily', 'Tom'],
    'Age': [25, 30, 35, 40, 50, 60],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'ShangHai', 'BeiJing'],
    'Sex': [True, False, True, False, True, False],
    'Score': [100, 101, 102, 103, 104, 105],
}
df = pd.DataFrame(data)

In [110]:
## 添加列
## 方法1:
# df['Hobby'] = ['movie', 'coffee', 'book', 'ball', 'hike', 'sleep']
#
# ## 方法2 位置、列名、列值
# df.insert(0, 'Hobby_bak', df['Hobby'])

## 删除某个列
# 方法1:
# del(df['Age'])

# 方法2: -- 这个会返回删除列的内容
# dd = df.pop('City')
# print(df)

# 方法3
# df.drop(columns=['Score'], inplace=True)
# print(df)

## 访问列
# df['Age']
# df[['Age', 'City']]
# df[:]['Name']
# df.loc[:, 'Age']
# # df.loc[:, 1] ##error, index已经更改
# df.iloc[:, 2] ## 指定iloc下标访问方式

In [115]:
### 添加行
## 方法1:这个是新增的 下标+1
# df.loc[len(df.index)] = ['hbj', 30, 'ShenZhen', True, 108, 'work']
## 方法2: 这个是新增的 test,不管之前是什么下标
# df.loc['test'] = ['hbj', 30, 'ShenZhen', True, 108]
## 方法3--ignore_index=True,会删除原来的索引,重新设置默认索引
##     --ignore_index=False,则原样拼接,保留原来索引,即使索引重复
# df2 = pd.concat([df, df], ignore_index=True)
# df2 = pd.concat([df, df], ignore_index=True)


### 行访问
# df[1] ## error 1个参数,会被解析为按列访问
# df.loc[1]
# df[3:5]
# df.loc[1:3, 'Age']
# df.iloc[2:6, 2:5]

### 设置索引后的 列访问
# df.index = ['a', 'b', 'c', 'd', 'e', 'f']
# df.loc[1] ##error 已经重置索引列
# df.loc['a']
# df.loc[['a', 'b']]
# df.iloc[:3]

### 行删除
## 删除指定的索引行
# df.drop(index=0, inplace=True)
## 删除指定的索引值
# df.index = ['a', 'b', 'c', 'd', 'e', 'f']
# df.drop('a')

      Name  Age         City    Sex  Score
b      Bob   30  Los Angeles  False    101
c  Charlie   35      Chicago   True    102
d    David   40      Houston  False    103
e     Lily   50     ShangHai   True    104
f      Tom   60      BeiJing  False    105

In [132]:
### 修改数据
df
## 这种方法高版本不可用了
##df['Name'][1] = 'Bobb'
## 替换成下面的方法--修改只有这种方法
df.loc[1, 'Name'] = 'BobF'
df.iloc[0, 1] = 33
df
## 这种都是只读
# df.loc()[1]['Score']

      Name  Age         City    Sex  Score
0    Alice   33     New York   True    100
1     BobF   30  Los Angeles  False    101
2  Charlie   35      Chicago   True    102
3    David   40      Houston  False    103
4     Lily   50     ShangHai   True    104
5      Tom   60      BeiJing  False    105

In [133]:
### 常用属性
df.axes ## (行列索引)

[RangeIndex(start=0, stop=6, step=1),
 Index(['Name', 'Age', 'City', 'Sex', 'Score'], dtype='object')]

In [134]:
df.dtypes

Name     object
Age       int64
City     object
Sex        bool
Score     int64
dtype: object

In [135]:
df.empty

False

In [136]:
df.ndim

2

In [139]:
df.size, len(df)

(30, 6)

In [140]:
df.values, type(df.values) ## 剔除索引

(array([['Alice', 33, 'New York', True, 100],
        ['BobF', 30, 'Los Angeles', False, 101],
        ['Charlie', 35, 'Chicago', True, 102],
        ['David', 40, 'Houston', False, 103],
        ['Lily', 50, 'ShangHai', True, 104],
        ['Tom', 60, 'BeiJing', False, 105]], dtype=object),
 numpy.ndarray)

In [141]:
df.head(3)

      Name  Age         City    Sex  Score
0    Alice   33     New York   True    100
1     BobF   30  Los Angeles  False    101
2  Charlie   35      Chicago   True    102

In [142]:
df.tail(5)

      Name  Age         City    Sex  Score
1     BobF   30  Los Angeles  False    101
2  Charlie   35      Chicago   True    102
3    David   40      Houston  False    103
4     Lily   50     ShangHai   True    104
5      Tom   60      BeiJing  False    105

In [181]:
### 统计属性
np.max(df['Score'])
np.min(df['Score'])
np.median(df['Score'])
np.mean(df['Score'])
np.std(df['Score'])
np.var(df['Score']) ##方差
np.cov(df['Score']) ##协方差
df.describe()
df.describe(include=['object', 'number'])

         Name        Age      City       Score
count       6   6.000000         6    6.000000
unique      6        NaN         6         NaN
top     Alice        NaN  New York         NaN
freq        1        NaN         1         NaN
mean      NaN  41.333333       NaN  102.500000
std       NaN  11.518102       NaN    1.870829
min       NaN  30.000000       NaN  100.000000
25%       NaN  33.500000       NaN  101.250000
50%       NaN  37.500000       NaN  102.500000
75%       NaN  47.500000       NaN  103.750000
max       NaN  60.000000       NaN  105.000000

In [169]:
df.sum(axis='index', numeric_only=True)
df.sum(axis='columns', numeric_only=True)
df.sum(axis='rows', numeric_only=True)
df.sum(axis=0, numeric_only=True)
df.sum(axis=1, numeric_only=True)

0    134
1    131
2    138
3    143
4    155
5    165
dtype: object

In [171]:
df.cumsum(axis=0)

,Name,Age,City,Sex,Score
0,Alice,33,New York,1,100
1,AliceBobF,63,New YorkLos Angeles,1,201
2,AliceBobFCharlie,98,New YorkLos AngelesChicago,2,303
3,AliceBobFCharlieDavid,138,New YorkLos AngelesChicagoHouston,2,406
4,AliceBobFCharlieDavidLily,188,New YorkLos AngelesChicagoHoustonShangHai,3,510
5,AliceBobFCharlieDavidLilyTom,248,New YorkLos AngelesChicagoHoustonShangHaiBeiJing,3,615

In [202]:
### 排序
## 按指定列排序
df.sort_values(by=['Score'], ascending=False)
## 先按age排序,后按score排序
df.sort_values(by=['Age', 'Score'], ascending=[True, False])

      Name  Age         City    Sex  Score
1     BobF   30  Los Angeles  False    101
0    Alice   33     New York   True    100
2  Charlie   35      Chicago   True    102
3    David   40      Houston  False    103
4     Lily   50     ShangHai   True    104
5      Tom   60      BeiJing  False    105

In [198]:
## 按索引排序
## 按索引列方向排序(索引值)
# df.sort_index(ascending=False)
## 按索引行方向排序(索引值)
df.sort_index(ascending=False, axis=1)

     Sex  Score     Name         City  Age
0   True    100    Alice     New York   33
1  False    101     BobF  Los Angeles   30
2   True    102  Charlie      Chicago   35
3  False    103    David      Houston   40
4   True    104     Lily     ShangHai   50
5  False    105      Tom      BeiJing   60

In [205]:
### 分组
## 可以查看图片images里的介绍
## https://zhuanlan.zhihu.com/p/101284491 --group
## https://zhuanlan.zhihu.com/p/100064394 --map apply applymap
## https://zhuanlan.zhihu.com/p/102274476 --merge

company=["A","B","C"]
data=pd.DataFrame({
    "company":[company[x] for x in np.random.randint(0,len(company),10)],
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
})
groupObj = data.groupby('company')
### groupBy后 需要转成list才能看懂存储的内容
list(groupObj)

[('A',
    company  salary  age
  0       A      32   43),
 ('B',
    company  salary  age
  1       B      45   30
  3       B      41   48
  6       B      18   43),
 ('C',
    company  salary  age
  2       C      39   46
  4       C      10   37
  5       C      47   40
  7       C      21   29
  8       C       7   15
  9       C      28   34)]